app/Controllers/Recherche.php

SELECT *
FROM `contact`
WHERE `contact`.`ID_Contact` = '0'
---
    public function modifier_contact($ID_Contact = null) {
        $contact = new ContactModel();
        $data['contact'] = $contact->find($ID_Contact);