app/Models/ContactModel.php

    public function getContact() {
        //variables utilisé
        // $id = $RechercheID;
        // $Nom = $RechercheNom;
        // $Prenom = $RecherchePrenom;
        // $Organisation = $RechercheOrganisation;
        // if($id != null){
        //si la recherche doit s'effectué par id
        //mysqli_query($db, "SELECT * FROM contact WHERE ID_Contact = '{$id}'");
        // }
        // if($Nom != null){
        //recherche effectué par le Nom
        //mysqli_query($db, "SELECT * FROM contact WHERE Nom_Contact = '{$Nom}'");
        //}
        // if($Prenom != null){
        //recherche effectué par le Prénom
        //mysqli_query($db, "SELECT * FROM contact WHERE Prenom_Contact = '{$Prenom}'");
        //}
        // if($Organisation != null){
        //recherche effectué par l'Organisation
        //mysqli_query($db, "SELECT * FROM contact WHERE ID_Organisation = '{$Organisation}'");
        //}


        return $this->findAll();
---
SELECT *
FROM `contact`