app/Models/ContactModel.php

    function getContact()
    {
        return $this->findAll();
---
SELECT *
FROM `contact`