app/Models/ContactModel.php

SELECT *
FROM `contact`
---
    public function getContact() {
        return $this->findAll();