app/Models/LoginModel.php

SELECT *
FROM `login`
---
    function getLogin() {
        return $this->findAll();