app/Models/OrganisationModel.php

    function getOrganisation() {
        return $this->findAll();
---
SELECT *
FROM `organisation`